<template>
  <div class="processDetail">
    <img :src="imgs[No].url" class="img" />
    <div class="description">{{ descriptions[No].text }}</div>
  </div>
</template>

<script>
export default {
  props: { No: Number },
  data() {
    return {
      imgs: [
        {
          url: require("@/assets/img/접수.png"),
        },
        {
          url: require("@/assets/img/기초검사.png"),
        },
        {
          url: require("@/assets/img/채혈검사.png"),
        },
        {
          url: require("@/assets/img/흉부방사선.png"),
        },
        {
          url: require("@/assets/img/진찰.png"),
        },
        {
          url: require("@/assets/img/자궁경부암.jpg"),
        },
        {
          url: require("@/assets/img/유방암.jpg"),
        },
        {
          url: require("@/assets/img/위 내시경.jpg"),
        },
        {
          url: require("@/assets/img/대장암검사.jpg"),
        },
        {
          url: require("@/assets/img/폐암검사.jpg"),
        },
      ],
      descriptions: [
        {
          text: "건강검진표 및 문진표를 작성하는 단계로, 건강검진 전 환자로부터 병에 대한 증상과 이전의 병력에 대해 묻는 과정을 말합니다.",
        },
        {
          text: "건강검진 시 가장 먼저 실시하는 검사이며, 신장, 체중, 혈압, 시력 측정 등 기초적인 신체 검사를 실시하는 단계입니다. 신체계측을 하는 이유는 현재 신체상태 평가뿐 아니라 장기간의 신체변화를 관찰할 수 있고 인구 집단 간의 신체차이를 비교하여 유전적 또는 환경적 요인의 상대적 중요성을 파악할 수 있기 떄문에 실시합니다.",
        },
        {
          text: "혈액과 소변에서 의학적 정보를 얻기 위한 검사로, 혈액 내 존재하는 세포의 수, 모양의 변화와 호르몬 및 대사 물질 수치에 이상이 있는 경우 여러 질환을 선별할 수 있고 소변검사를 통해 신장 및 비뇨기계, 내분비(호르몬), 대사성 등 각종 질환의 정보를 알 수 있어 건강검진에 있어서 필수적인 검사라 할 수 있습니다.",
        },
        {
          text: "흉부방사선 검사는 가장 흔하게 행해지는 방사선 검사 중 하나로, 폐와 심장 계통의 질환에 대해 많은 것을 알려주는 중요한 검사입니다. 폐 부위와 심장, 횡격막 및 쇄골, 늑골, 흉추 등의 이상을 검사할 수 있습니다.",
        },
        {
          text: "진찰은 환자의 상태를 듣고 관찰하여 병상 및 병명을 규명하고 판단하는 것입니다. 지금까지 검사한 내용을 바탕으로 담당 의사와 상담을 진행하여 검사 결과에 대하여 들으실 수 있습니다.",
        },
        {
          text: "자궁경부암에서 행해지는 검사 방법은 크게 실제로 암이 맞는지 확인하는 조직검사와 암이 어느 정도까지 진행되었는지를 확인하기 위한 병기 설정 검사로 나눌 수 있습니다.",
        },
        {
          text: "유방 병소의 진단은 자가 검진 및 임상 진찰, 방사선 검사(유방촬영술, 유방 초음파술 등), 생검 등이 있습니다. 유방확대술을 받으면 유방암 발견이 어렵다고 생각할 수 있으나 불법 시술이나 주사로 인해 유방 조직이 망가진 경우가 아니라면 검진을 위해 유방촬영 외에 유방초음파 등 추가검사가 필요할 수 있습니다.",
        },
        {
          text: "일반적으로 상부위장관촬영술이나 위내시경검사로 위암을 진단할 수 있습니다. 위내시경검사를 할 때 조직검사를 하여 암세포를 발견하면 확진할 수 있습니다. 전산화단층촬영술이나 초음파검사를 시행하여 암이 주변 장기를 침범하였는지, 림프절 혹은 다른 장기로 전이되었는지 확인합니다.",
        },
        {
          text: "대장암의 약 35%(직장암의 약 75%)가 직장수지 검사만으로도 진단이 가능합니다. 40세 이후에는 매년 1회의 직장수지 검사가 권장되고 있습니다. 대장전체의 관찰이 가능하고 검사와 동시에 조직검사를 할 수 있는 대장내시경이 대장암 진단에 가장 효과적이고 정확한 검사로 추천되고 있습니다.",
        },
        {
          text: "폐암 진단 방법에는 여러 가지 검사가 있는데, 폐암으로 의심되는 증상이 있을 경우 흉부X-선촬영, 흉부CT촬영, 객담검사, 기관지 내시경검사, 경피적 세침 생검술 등을 통해 폐암인지 여부를 가려내며, 그 진행 정도 등을 판단합니다.",
        },
      ],
    };
  },
};
</script>

<style>
.img {
  width: 180x;
  height: 120px;
  float: left;
  margin-right: 5%;
}
.description {
  font-size: 20px;
  color: #5780c6;
  text-align: justify;
}
.processDetail {
  margin-left: 5%;
  margin-right: 5%;
}
</style>
